'''
for <переменная цикла> in <значения переменной>: # Заголовок 
    <интсрукция_1>
    <интсрукция_2>
    <интсрукция_3>     # Тело оператора
        ....
    <интсрукция_n>
'''
 
for i in 1, 3, 4:
    print(i**2, end=' ')
 
for i in 1, 3, 4:
1 9 16  
Конструкция цикла for
'''
for <переменная цикла> in <значения переменной>: # Заголовок 
    <интсрукция_1>
    <интсрукция_2>
    <интсрукция_3>     # Тело оператора
        ....
    <интсрукция_n>
'''
 
for i in 1, 3, 4:
    print(i**2, end=' ')
 
for i in 1, 3, 4:
    print(i**2, end='\n')
1 9 16  
Конструкция цикла for
'''
for <переменная цикла> in <значения переменной>: # Заголовок 
    <интсрукция_1>
    <интсрукция_2>
    <интсрукция_3>     # Тело оператора
        ....
    <интсрукция_n>
'''
 
for i in 1, 3, 4:
    print(i**2, end=' ')
 
for i in 1, 3, 4:
    print(i**2, end='\n')